{
  "title": "Structure of Human Eye",
  "description": "The human eye is a complex and highly specialized organ that detects light and converts it into electrical signals that are transmitted to the brain, enabling us to see and interpret visual information.",
  "subtopics": {
    "Outer Structures": {
      "title": "Outer Structures",
      "description": "The outer structures of the eye include the cornea, sclera, and conjunctiva, which provide protection, shape, and support to the eye.",
      "subtopics": {
        "Cornea": {
          "title": "Cornea",
          "description": "The cornea is the transparent, dome-shaped surface at the front of the eye, responsible for refracting light and providing a clear window into the eye.",
          "subtopics": {}
        },
        "Sclera": {
          "title": "Sclera",
          "description": "The sclera is the white, tough, fibrous layer that covers the entire eyeball, except for the cornea, providing protection and structure to the eye.",
          "subtopics": {}
        },
        "Conjunctiva": {
          "title": "Conjunctiva",
          "description": "The conjunctiva is a thin, transparent membrane that covers the white part of the eye and the inside of the eyelids, helping to lubricate and protect the eye.",
          "subtopics": {}
        }
      }
    },
    "Inner Structures": {
      "title": "Inner Structures",
      "description": "The inner structures of the eye include the lens, retina, and optic nerve, which work together to focus light, convert it into electrical signals, and transmit these signals to the brain.",
      "subtopics": {
        "Lens": {
          "title": "Lens",
          "description": "The lens is a clear, flexible, biconvex structure behind the iris that changes shape to focus light on the retina, allowing us to see objects at varying distances.",
          "subtopics": {}
        },
        "Retina": {
          "title": "Retina",
          "description": "The retina is the innermost layer of the eye that senses light and converts it into electrical impulses that are transmitted to the brain.",
          "subtopics": {
            "Photoreceptors": {
              "title": "Photoreceptors",
              "description": "Photoreceptors are specialized cells in the retina that convert light into electrical signals, including rods and cones, which are sensitive to different types of light and are responsible for peripheral and central vision, respectively.",
              "subtopics": {}
            },
            "Macula": {
              "title": "Macula",
              "description": "The macula is a specialized area at the center of the retina responsible for central vision, fine detail, and color perception, with a high concentration of photoreceptors and a unique structure that allows for sharp, clear vision.",
              "subtopics": {}
            }
          }
        },
        "Optic Nerve": {
          "title": "Optic Nerve",
          "description": "The optic nerve is a bundle of nerve fibers that carries electrical signals from the retina to the brain, where they are interpreted and understood as visual information.",
          "subtopics": {}
        }
      }
    }
  }
}